Tekla Open API Reference for Tekla Structures 2025
Picker.PickObjectEnum Enumeration
 The possible model object pick types for a single object.
 Namespace: Tekla.Structures.Model.UI
 Assembly: Tekla.Structures.Model (in Tekla.Structures.Model.dll) Version: 2025.0.0-alpha00048669+a99462f17964bc42624ada6e8d316db2d795d226
Syntax
public enum PickObjectEnum
Public Enumeration PickObjectEnum
Members
Member name | Value | Description
PICK_ONE_OBJECT | 0 |  Pick one model object of any type.
PICK_ONE_PART | 1 |  Pick one part.
PICK_ONE_WELD | 2 |  Pick one welding.
PICK_ONE_BOLTGROUP | 3 |  Pick one bolt group.
PICK_ONE_REINFORCEMENT | 4 |  Pick one reinforcement.
See Also
Reference
Tekla.Structures.Model.UI Namespace